In [0]:
!pip install -q mysql.connector

     |████████████████████████████████| 11.9MB 2.9MB/s
  Building wheel for mysql.connector (setup.py) ... done

In [0]:
import numpy as np
import pandas as pd
import json
import requests
import pandas_datareader.data as web
import matplotlib.pyplot as plt
import mglearn
from sklearn.model_selection import train_test_split
from sklearn.datasets import make_blobs
import warnings

/usr/local/lib/python3.6/dist-packages/sklearn/externals/six.py:31: DeprecationWarning: The module is deprecated in version 0.21 and will be removed in version 0.23 since we've dropped support for Python 2.7. Please rely on the official version of six (https://pypi.org/project/six/).
  "(https://pypi.org/project/six/).", DeprecationWarning)
/usr/local/lib/python3.6/dist-packages/sklearn/externals/joblib/__init__.py:15: DeprecationWarning: sklearn.externals.joblib is deprecated in 0.21 and will be removed in 0.23. Please import this functionality directly from joblib, which can be installed with: pip install joblib. If this warning is raised when loading pickled models, you may need to re-serialize those models with scikit-learn 0.21+.
  warnings.warn(msg, category=DeprecationWarning)

In [0]:
import mysql.connector as sql
import pandas as pd
db_connection = sql.connect(host='remotemysql.com', database='u9aMBzxchm', user='u9aMBzxchm', password='BVijKCi9ju')
db_cursor = db_connection.cursor()
db_cursor.execute('SELECT * FROM sales1')
table_rows = db_cursor.fetchall()
df = pd.DataFrame(table_rows)
df

     0           1                2           3     4               5
0    1      Andrew       Television  2016-06-07  2500      Television
1    2       Bryan  Washing Machine  2016-07-10  1100      Television
2    4        Dean     Refrigerator  2016-09-15   583      Television
3    5       Esryl         Wall Fan  2016-10-11    45      Television
4    6      Franky       Steam Iron  2016-10-17     0      Television
5    7       Gerry  Air Conditioner  2016-11-17   325      Television
6    9        Nome       Television  2019-06-07  2500      Television
7   10        nome             item  2019-01-01    10           teste
8   11        nome             item  2019-02-02   123      comentario
9   12        Nome       Television  2019-06-07  2500      Television
10  14        Nome       Television  2019-06-07  2500      Television
11  15        Nome       Television  2019-06-07  2500      Television
12  16  Presidente        Republica  2019-01-01     1          melhor
13  17       teste         external  2016-09-10     1  mysql external